app/Http/Controllers/NewsController.php

select * from `news` where `is_active` = 1 and `news_for` = 1 or `news_for` = 2 order by `start_date` desc
---
    public function showPublic(){
        $currentDate = date((time() + (7 * 60 * 60)));

        $news = News::where('is_active', '=', 1)
                    ->where('news_for', '=', 1)
                    ->orWhere('news_for', '=', 2)
                    // ->where('start_date', '>=', $currentDate)
                    // ->where('end_date', '<=', $currentDate)
                    ->orderBy('start_date', 'DESC')
                    ->get();
        Session::put('url', '/');
        return view('public.index')->with('news', $news);