app/Http/Controllers/TeamController.php

    public function exhibition(){
        $collections = Team::select('teams.*', 'periods.year', 'periods.semester')
        ->join('periods', 'teams.id_period', '=', 'periods.id')
        ->where('teams.is_active', 1)
        ->orderBy('id_period', 'DESC')
        ->orderBy('id', 'DESC')
        ->orderBy('name')
        ->get();
        $dictionary_key = array();
        for ($i=0; $i < count($collections) ; $i++) {
            $dictionary_key[$collections[$i]->id] = $i;
        }
        $collectionsTeamCategory = TeamCategory::select('team_categories.id_team', 'categories.name')
        ->join('categories', 'team_categories.id_category', '=', 'categories.id')
        ->join('teams', 'teams.id', '=', 'team_categories.id_team')
        ->where('teams.is_active', '=', 1)
        ->orderBy('team_categories.id_team', 'DESC')
        ->orderBy('categories.name')
        ->get();
        for ($i=0; $i < count($collectionsTeamCategory) ; $i++) {
            $collections[$dictionary_key[$collectionsTeamCategory[$i]->id_team]]->categories .= $collectionsTeamCategory[$i]->name.", ";
        }
        $collectionsDocument = TeamDocument::join('teams', 'teams.id', '=', 'team_documents.id_team')
        ->where('teams.is_active', 1)
        ->where('team_documents.deleted_at', null)
        ->orderBy('team_documents.id_team', 'ASC')
        ->orderBy('team_documents.id_team_require_documents', 'ASC')
        ->orderBy('team_documents.sort', 'ASC')
        ->get();
---
select `teams`.*, `periods`.`year`, `periods`.`semester` from `teams` inner join `periods` on `teams`.`id_period` = `periods`.`id` where `teams`.`is_active` = 1 order by `id_period` desc, `id` desc, `name` asc
select `team_categories`.`id_team`, `categories`.`name` from `team_categories` inner join `categories` on `team_categories`.`id_category` = `categories`.`id` inner join `teams` on `teams`.`id` = `team_categories`.`id_team` where `teams`.`is_active` = 1 order by `team_categories`.`id_team` desc, `categories`.`name` asc
select * from `team_documents` inner join `teams` on `teams`.`id` = `team_documents`.`id_team` where `teams`.`is_active` = 1 and `team_documents`.`deleted_at` is null order by `team_documents`.`id_team` asc, `team_documents`.`id_team_require_documents` asc, `team_documents`.`sort` asc

    public function exhibitionDetail(Request $request){
        $checkBySlug = Team::where('slug', $request->slug)
        ->get();
        $checkById = Team::where('id', $request->slug)
        ->get();
        $collections = "";
        if(isset($checkBySlug[0])){
            $collections = Team::select('teams.*', 'periods.year', 'periods.semester')
            ->join('periods', 'teams.id_period', '=', 'periods.id')
            ->where('teams.slug', $request->slug)
            ->orderBy('id_period', 'DESC')
            ->orderBy('id', 'DESC')
            ->orderBy('name')
            ->get();
        }else if(isset($checkById[0])){
            $collections = Team::select('teams.*', 'periods.year', 'periods.semester')
            ->join('periods', 'teams.id_period', '=', 'periods.id')
            ->where('teams.id', $request->slug)
            ->orderBy('id_period', 'DESC')
            ->orderBy('id', 'DESC')
            ->orderBy('name')
            ->get();
---
select * from `teams` where `slug` = 'ratu'
select * from `teams` where `id` = 'ratu'
select `teams`.*, `periods`.`year`, `periods`.`semester` from `teams` inner join `periods` on `teams`.`id_period` = `periods`.`id` where `teams`.`slug` = 'ratu' order by `id_period` desc, `id` desc, `name` asc

        for ($i=0; $i < count($collections) ; $i++) {
            $dictionary_key[$collections[$i]->id] = $i;
        }
        $collectionsTeamCategory = TeamCategory::select('team_categories.id_team', 'categories.name')
        ->join('categories', 'team_categories.id_category', '=', 'categories.id')
        ->where('team_categories.id_team', $collections[0]->id)
        ->orderBy('categories.name')
        ->get();
---
select `team_categories`.`id_team`, `categories`.`name` from `team_categories` inner join `categories` on `team_categories`.`id_category` = `categories`.`id` where `team_categories`.`id_team` = 3 order by `categories`.`name` asc

        }


        $collectionsDocument = TeamDocument::where('deleted_at', null)
        ->where('is_active', 1)
        ->where('id_team', $collections[0]->id)
        ->orderBy('id_team', 'ASC')
        ->orderBy('id_team_require_documents', 'ASC')
        ->orderBy('sort', 'ASC')
        ->get();
---
select * from `team_documents` where `deleted_at` is null and `is_active` = 1 and `id_team` = 3 order by `id_team` asc, `id_team_require_documents` asc, `sort` asc